# append(item) - добавление нового элемента в конец списка

# extend(list) - добавляет элементы из списка в конец другого списка

# insert(item) - вставляет элемент по указанному индексу

# remove(item) - удаляет элемент из списка

# pop(index) - возвращает элемент по указанному индексу и удаляет его из списка

# clear() - удаляет все элементы из списка

# Index(item) - возвращат индекс указанного элемента

# count(item) - возвращает количество указанных элеметов в списке

# sort(key=None, reverse=False) - сортирует список в порядке возрастания или убывания

# reverse() - обратный порядок списка

# copy() - возвращает поверхностную копию списка

# Глубокая копия рекурсивно вставляет в него копии объектов, находящихся в оригинале
