// let arr = [1, 2, 3, "text", true, "text2"];
// console.log(arr)
// console.log(arr[3]); // text

// for (let item of arr) {
//     console.log("Элемент: " + item);
// }

// for (let index in arr) {
//     console.log("Индекс: " + index);
// }

// for (let i = 0; i < arr.length; i++) {
//     console.log("Index" + i + "element" + arr[i])
// }

// // Методы массива

// let arr2 = [1, 2, 3, 4, 5];
// let arr3 = [];

// let newArray;
// arr2 = arr2.push(6, 7, 8, 9); // append
// console.log({arr2});
// console.log({arr2});



// Методы массивов(списков) -----------------------------------------------------------------

// arr - это НАЗВАНИЕ СПИСКА ДЛЯ ПРИМЕРА

// arr.push() - добавляет значение в конец массива
// arr.pop() - удаляет значение из конца массива и возвращает его
// arr.unshift(value) - добавляет значение в начало массива
// arr.shift() - удаляет значение из начала массива и возвращает его
// arr.length - это значение соответствующее количеству значений в массиве
// arr.indexOf(el) - выводит индекс элемента
// arr.forEach((el)) - цикл for и выводит элементы списка

// ------------------------------------------------------------------------------------------

// let arr2 = [10, 20, 30, 40, 50];

// arr2.forEach((el) => {
//     console.log("Index - " + arr2.indexOf(el) + " of element " + el);
// })

// console.log((arr2))

// ------------------------------------------------------------------------------------------
// function название(элементы) {
//      return ...
// }

// function sum(a, b) {
//     let res = 0;
//     alert("Функция вызвалась!");
//     res = a + b;
//     alert(res);
//     return res;
// }

// alert(res);
// // const res = 

// ------------------------------------------------------------------------------------------

// TASK 1 ------------------------------------------------------------------------------------------

// let list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

// function print_list(list_1) {
//     alert("Функция вывода списка сработала");
//     console.log(list_1);
//     alert(list_1);
//     return list_1;
// }

// console.log(print_list(list_1));

// ------------------------------------------------------------------------------------------

// TASK 2 ------------------------------------------------------------------------------------------

let list_1 = [1,2,3,4,5];
let list_2 = [1,2,3,4,5,6,7,8,9,10];

function lists_append(list_1, list_2) {

    let list_3 = [];

    list_1.forEach(element => {
        if (list_2.includes(element)) {
            list_3.push(element)
        }
    });
    return list_3;
}

console.log(" Числа которые совпадают: " + lists_append(list_1, list_2))
alert(" Числа которые совпадают: " + lists_append(list_1, list_2))

// ------------------------------------------------------------------------------------------
