function numberToWords(number) {
    if (number < 10) {
      const units = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"];
      return units[number];
    } else if (number < 20) {
      const teens = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"];
      return teens[number - 10];
    } else {
      const tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"];
      const units = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"];
      return tens[Math.floor(number / 10)] + " " + units[number % 10];
    }
  }

  console.log("Task 2")
  console.log("---------------------------------------------------------------")
  const number = prompt("Введите число: ");
  const words = numberToWords(number);
  console.log(`${number} – ${words}`);
  console.log("---------------------------------------------------------------")
